{
    "Food_1": {
      "Food_Name": "Jollof Rice",
      "Ingredients": "1 tablespoon olive oil 1 large onion, sliced 2 (14.5 ounce) cans stewed tomatoes ½ (6 ounce) can tomato paste 1 teaspoon salt ¼ teaspoon black pepper ¼ teaspoon cayenne pepper ½ teaspoon red pepper flakes 1 tablespoon Worcestershire sauce  1 teaspoon chopped fresh rosemary 2 cups water 1 (3 pound) whole chicken, cut into 8 pieces 1 cup uncooked white rice 1 cup diced carrots ½ pound fresh green beans, trimmed and snapped into 1 to 2 inch pieces ¼ teaspoon ground nutmeg",
      "calories": "284",
      "Directions": "Step 1 Pour oil into large saucepan. Cook onion in oil over medium-low heat until translucent. Step 2 Stir in stewed tomatoes and tomato paste, and season with salt, black pepper, cayenne pepper, red pepper flakes, Worcestershire sauce and rosemary. Cover, and bring to a boil. Reduce heat, stir in water, and add chicken pieces. Simmer for 30 minutes. Step 3 Stir in rice, carrots, and green beans, and season with nutmeg. Bring to a boil, then reduce heat to low. Cover, and simmer until the chicken is fork-tender and the rice is cooked, 25 to 30 minutes.",
      "Origin":"The most adopted theory for the expansion of the dish explains Jollof Rice as having its origins in the Senegambia region of west Africa, in the ancient Wolof or Jolof Empire, during the 14th-16th century. The former empire is located in what is considered to be parts of modern-day Senegal, The Gambia, and Mauritania. With rice farming being prominent across the Senegal river, this region became known as the grain coast. In 1448, the Portuguese developed trading posts by the river, and introduced goods, including tomatoes, which would become essential to the development of the dish.",
      "Benefits":"Jollof Rice makes you happy. A study carried out in my house showed that family members are generally happier when lunch (or dinner) is shown to be Jollof Rice. It may be related to the release of oxytocin in the brain as our eyes register the pleasure that is a steaming heap of sinfully orange rice. And fried plantain. Jollof Rice contains tomatoes, peppers and onions. Tomatoes are good for you. They help prevent cancer. Peppers are good for you. They contain lots of vitamins. Onions are good for you. They reduce inflammation and heal infections. Jollof Rice contains rice. Rice is a well-known source of energy and fiber. Enough said.Jollof Rice strengthens family and friendship bonds. See number 1 above. Jollof Rice strengthens national bonds. See how Nigerians unite in solidarity against the Ghanaians over who makes superior Jollof Rice (free advice: Nigerians do). See how West Africans united against the Jamie Oliver Jollof Rice travesty. Jollof Rice brings back good memories, very key to good mental health. Think about it. Do you have any bad memories associated with jollof rice? Now think about eba. Or beans. Ehen. Jollof Rice goes well with red wine, which is good for your heart.",
      "Culture":"Jollof rice is a popular dish in West Africa. The name jollof originates from a Senegambian kingdom called the Jolof Empire. Many countries of the sub-continent have their own methods of preparation, but the ongoing feud between Nigeria and Ghana regarding whose jollof rice is better may never be resolved. Both countries have different methods of preparation and also make use of different spices but, for Nigerians, there is only one king of rice!"
    },
    "Food_2": {
      "Food_Name": "CheeseBurger",
      "Ingredients": "Ingredients 1 lb. ground beef (80/20) 1 lb. ground sirloin (90/10) 1 tbsp. Worcestershire sauce 1 tsp. kosher salt 1 tsp. ground black pepper 1 tbsp. vegetable oil 4 toasted hamburger buns Optional toppings: American cheese, shredded iceburg lettuce, sliced tomato, sliced red onion, dill pickle slices, ketchup, mustard, and mayonnaise",
      "calories": "345",
      "Direction": "Combine the ground beef, ground sirloin, Worcestershire sauce, salt, and pepper in a large bowl. Gently mix the beef mixture to thoroughly combine with the seasoning. Divide the mixture into 4 even portions, about 8 ounces each. Pat each portion into a ball (but not too tightly), then press into one-inch thick patties. On the stovetop: Heat a large cast-iron skillet over medium-high heat. Add 1 tablespoon of vegetable oil and swirl to coat the pan. Place the patties in the skillet and let cook for 3 to 4 minutes until golden and crusty. Flip and cook the other side until the internal temperature of the burger reaches 135˚ (for medium doneness), about 3 more minutes. If you like cheese on your burgers, add it during the last minute of cooking, then cover to melt. Alternatively cook on the grill: Preheat your grill over medium-high heat, 400 to 425˚. Oil the grill grates. Place the patties on the grill over direct heat. Cook for 3 to 4 minutes per side, covered, or until the internal temperature reads 135˚ (for medium doneness). If you like cheese on your burgers, add it during the last minute of cooking, then cover to melt.Serve immediately on toasted buns with whatever toppings you like!",
      "Origin":"Many food historians credit 16-year-old Lionel Sternberger, who in 1924 decided to slap a slice of American cheese (what else?) onto a cooking hamburger at his father's Pasadena, California, sandwich shop, the Rite Spot. He liked it, and so did his dad, and thus the cheeseburger was born. Or was it? They called it a cheese hamburger, so that may disqualify the Sternbergers on a technicality.The Best Way to Cut Open a Pomegranate The first sandwich to actually be called a cheeseburger was at Kaelin's restaurant in Louisville Kentucky. Charles Kaelin claims to have invented the cheese-topped burger in 1934 because he wanted reports Louisville writer Robin Garr, to add a new tang to the hamburger. This is the earliest example of a menu claiming to be  the birthplace of the cheeseburger.",
      "Benefits":"The red meat packed in cheeseburger provides a nutritious ingredient. It is considered to be a good source of iron. Iron is essential in our body as it plays an important role in delivering oxygen that is required for all cells to maintain their function. When oxygen uptake in cells are sufficient, it allows the body to function optimally. Here you go for more: Health Benefits of Black Bean Burgers Adult men require 8 milligrams of daily iron intake, while women need 18 milligrams. Pregnant women are prescribed 27 milligrams of iron because a higher amount of oxygen delivery is necessary for fetal development.",
      "Culture":"As we move into new adventures beyond national borders, whether for fun or for work, we “hungry” young travellers often take refuge in what could be described as the “oasis” in the middle of a desert of unknown flavours that surrounds us. We are talking about fast food chains.The history of fast food runs parallel to the birth of the first industries where people worked more than 12 hours a day. So that for the great productivity and for many working hours, the first fast food restaurants were founded in front of the large industrial complexes. In 1937, Richard and Maurice McDonald brothers opened in San Bernardino, California, their first restaurant specialized in hamburgers. Their business is profitable and McDonald brothers put in place a assembly-line system that allows them to increase their productivity."
    },

      "Food_3": {

        "Food_Name": "Fried Rice",
        "Ingredients": "⅔ cup chopped baby carrots ½ cup frozen green peas  2 tablespoons vegetable oil 1 clove garlic, minced, or to taste (Optional) 2 large eggs 3 cups leftover cooked white rice 1 tablespoon soy sauce, or more to taste 2 teaspoons sesame oil, or to taste",
        "Calories": "280",
        "Direction": "Place carrots in a small saucepan and cover with water. Bring to a low boil and cook for 3 to 5 minutes. Stir in peas, then immediately drain in a colander. Step 2 Heat a wok over high heat. Pour in vegetable oil, then stir in carrots, peas, and garlic; cook for about 30 seconds. Add eggs; stir quickly to scramble eggs with vegetables. Step 3 Stir in cooked rice. Add soy sauce and toss rice to coat. Drizzle with sesame oil and toss again.",
        "Origin":"Fried rice is a dish that has been around for centuries. Historians believe that is may have originated in the city of Yangzhou, which is in the eastern province of Jiangsu. In fact, there is a type of fried rice that is known as Yang Zhou fried rice. The Yang Zhou version is considered the earliest known formal recipe and will often contain leftover rice, eggs, vegetables, and at least two types of meat. While these are the main elements in the dish, it will also consist of a variety of seasonings including soy sauce, Shaoxing wine, stock, and oil. You will also see this dish made with lard.",
        "Benefits": " Maintaining healthy skin was not difficult and had to spend big funds. Because you can maintain healthy skin just by eating fried rice. This is because fried rice helps the healing process of vitiligo a disease that causes the skin to lose normal pigmentation. Read more: health benefits of banana peel for skin ",
        "Culture":"While the exact origins of fried rice are lost to history, it’s believed that it was invented sometime during the Sui dynasty (A.D. 589–618), in the city of Yangzhou in eastern Jiangsu province.Yangchow (Yangzhou) fried rice is still the standard by which all other Chinese fried rice dishes are judged: morsels of fluffy rice tossed with roast pork, prawns, scallions, and peas. In American-Chinese restaurants, you’ll sometimes find it called special fried rice"

},

"Food_4": {

  "Food_Name": "Yam and Sauce",
  "Ingredients": "1kg (2.2 lbs) white puna yam 200g Nigerian pumpkin leaves Palm oil 200g ukpaka (shredded oil bean seeds) Ogiri Igbo (castor bean paste) 1 Habanero/Scotch Bonnet pepper or to taste Salt",
  "chalories": "280",
  "Direction": "Boil the yam, vegetable and ukpaka positioned the yam pieces in a pot and pour water to cowl the yams. region the tied greens and ukpaka on top and prepare dinner until the ukpaka and veggies are gentle. retain cooking the yam if now not finished. Make the vegetable sauce Pound the habanero pepper in a mortar until easy. while the ukpaka and pumpkin leaves are tender (from step 2 above), pound them inside the identical mortar one after the alternative till they’re as smooth as viable. upload palm oil to the combo till you get a consistency you want and blend thoroughly. upload salt and ogiri Igbo in your taste and blend with the pestle until the whole thing is well included. Dish in a serving bowl and set aside.",
  "Origin":"The scene is a familiar one. People sit around a rectangular table, the bulk of which is taken up by a smooth iron cooktop. Gas flames flicker underneath. A man wearing a tall red hat and a white chef's uniform approaches, pulling a cart filled with cold food, large cooking utensils and various bottles of sauces. He holds a spatula and a large metal fork. He brings them together: cling-clang, cling-clang. Eyes sparkling, he looks around the table.Welcome to Benihana.",
  "Benefits":"In one 30-day study, 24 postmenopausal women switched from their staple food of rice to eating yams in 2 out of 3 meals (390 grams total) per day. Their blood levels of estrone and estradiol increased by 26% and 27%, respectively (11Trusted Source). Blood levels of estrone and estradiol — two estrogen hormones — typically decrease during menopause. Improving estrogen levels may ease menopause symptoms (12Trusted Source, 13Trusted Source). Yet, another six-month study found that topically applied wild yam cream had very little effect on menopause symptoms, such as flushing and night sweats, compared with a placebo (14Trusted Source). Further research is needed to investigate the role that yams may have in relieving menopause symptoms.",
  "Culture":"knobbly and brown, with little, wispy, hair-like roots shooting off at random, yams aren't the stateliest of foods. But if you get past their slightly odd appearance, you may very well fall in love. That is, if you even cross paths with a real yam. Chances are, unless you’re doing most of your grocery shopping at African, Caribbean, or Asian markets, or grew up eating and cooking these tubers, what you imagine when I say “yam” is actually just an orange sweet potato."

},

"Food_5": {

  "Food_Name": "Shawarma",
  "Ingredients": "½ cup malt vinegar  ¼ cup plain yogurt 1 tablespoon vegetable oil salt and pepper to taste 1 teaspoon mixed spice ¼ teaspoon freshly ground cardamom 8 skinless, boneless chicken thighs ½ cup tahini ¼ cup plain yogurt ½ teaspoon minced garlic 2 tablespoons lemon juice 1 tablespoon olive oil 1 tablespoon chopped fresh parsley salt and pepper to taste 4 medium tomatoes, thinly sliced ½ cup sliced onion 4 cups shredded lettuce 8 pita bread rounds",
  "chalories": "402",
  "birthday": "In a glass baking dish, mix together the malt vinegar, 1/4 cup yogurt, vegetable oil, mixed spice, cardamom, salt and pepper. Place the chicken thighs into the mixture and turn to coat. Cover and marinate in the refrigerator for at least 4 hours or overnight. Step 2 Preheat the oven to 350 degrees F (175 degrees C). In a small bowl, mix together the tahini, 1/4 cup yogurt, garlic, lemon juice, olive oil, and parsley. Season with salt and pepper, taste, and adjust flavors if desired. Cover and refrigerate. Step 3 Cover the chicken and bake in the marinade for 30 minutes, turning once. Uncover, and cook for an additional 5 to 10 minutes, or until chicken is browned and cooked through. Remove from the dish, and cut into slices. Step 4 Place sliced chicken, tomato, onion, and lettuce onto pita breads. Roll up, and top with the tahini sauce.",
  "Origin":"Shawarma is a Levantine Arab meat preparation, where lamb, chicken, turkey, beef, veal, or mixed meats are placed on a spit (commonly a vertical spit in restaurants), and may be grilled for as long as a day. Shavings are cut off the block of meat for serving, and the remainder of the block of meat is kept heated on the rotating spit. Shawarma can be served on a plate (generally with accompaniments), or as a sandwich or wrap. Shawarma is usually eaten with tabbouleh, fattoush, taboon bread, tomato, and cucumber. Toppings include tahini, hummus, pickled turnips, and amba.  Similar dishes in the region include Turkish döner kebabs and Greek gyros. ",
  "Benefits":"Fulfilling the nutrient needs in the body is a must. As a result, you have to consume best foods in a right way to get the healthier body. This case also means you may need nutrients but at the same time wish for delicious food to be eaten. As the consequence, shawarma is ready to help. With wonderful taste and great nutrients contained in it, you will not be regret to choose this one as your food option. One of health benefits of shawarma is the way it provides great source of vitamin A.",
  "Culture":"Most will agree that the secret to shawarma’s taste lies in the way the meat is cooked and much credit must go to the chefs of the Ottoman Empire (1299 – 1923) who were among the first to see the benefit of roasting meat vertically. They noticed that horizontal roasting robbed the meat of all of its delicious fat as it simply dripped into the fire; worse still, as it did so it caused the flames to rise, scorching the outside of the meat as a result. Vertical roasting means that the meat is bathed in its own fat as it cooks, making it soft, tender and delicious, and keeping the flames under control allows the meat to be roasted nice and slowly, cooking it to perfection."


},

"Food_6": {

  "Food_Name": "Meat Pie",
  "Ingredients": "In a glass baking dish, mix together the malt vinegar, 1/4 cup yogurt, vegetable oil, mixed spice, cardamom, salt and pepper. Place the chicken thighs into the mixture and turn to coat. Cover and marinate in the refrigerator for at least 4 hours or overnight. Step 2 Preheat the oven to 350 degrees F (175 degrees C). In a small bowl, mix together the tahini, 1/4 cup yogurt, garlic, lemon juice, olive oil, and parsley. Season with salt and pepper, taste, and adjust flavors if desired. Cover and refrigerate. Step 3 Cover the chicken and bake in the marinade for 30 minutes, turning once. Uncover, and cook for an additional 5 to 10 minutes, or until chicken is browned and cooked through. Remove from the dish, and cut into slices. Step Place sliced chicken, tomato, onion, and lettuce onto pita breads. Roll up, and top with the tahini sauce.",
  "chalories": "350",
  "birthday": "Step 1 Preheat the oven to 425 degrees F (220 degrees C). Place the potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 5 minutes. Drain, mash, and set aside. Step 2 Meanwhile, crumble the ground beef and pork into a large saucepan, and add the garlic, onion and water. Season with mustard powder, thyme, cloves and salt. Cook over medium heat, stirring to crumble the meat and mix in the spices, until the meat is evenly browned. Remove from the heat, and mix in the mashed potato. Step 3 Place one of the pie crusts into a 9 inch pie plate. Fill with the meat mixture, then top with the other pie crust. Prick the top crust a few times with a knife to vent steam. Crimp around the edges using the tines of the fork, and remove any excess dough. Cover the edges of the pie crust with aluminum foil. Step 4 Bake for 25 minutes in the preheated oven, or until the crust has browned. Serve by itself, or with a beef gravy.",
  "Origin":"According to Brisbane food historian Dr Janet Clarkson, who has spent years researching our culinary icon, the pie was invented as a way to preserve meat in medieval Europe. Amazingly, the pastry, today an essential part of a good pie, was not meant to be eaten, The Courier-Mail reports. There were no metal baking dishes or ways to keep food fresh, so the pastry was used both as cooking container and preserver Dr Clarkson said. Called a coffin it was made with very hard rye flour up to seven inches thick and wrapped around the meat and baked. This could preserve meat for up to a year. Author of the just released Pie: A Global History, Dr Clarkson said the rock-hard pastry was given to the poor or crumbled up in the kitchens of the rich and used to thicken soups. While the pie may today be an egalitarian symbol of our classless society, beloved by tradies and share traders alike it was originally food for the rich according to Dr Clarkson.",
  "Benefits":"Flour, also known as all-purpose or refined flour, is made from wheat grains and the key ingredient of Nigerian meat pies; other substances in the mix are just side ingredients. Carbohydrates, protein, fiber, iron, thiamin, and other important nutrients are found in this type of flour. Though most vitamins and minerals in refined flour are taken out during processing, some nutrients are readded to make the flour healthy.",
  "Culture":"All pies, from the sweet American variety to the New Zealand and Australian savouries, can be traced back to Greece. Historians the world over believe the early pastry shells, made by combining flour and water, had Greek origins, and were then embraced by the Romans. Wealthy Romans would add many types of meats (and sometimes seafood) to their pies, which would often feature alongside the dessert course. Eventually, the British adopted their own version of the dish: theirs was filled with different types of meat — including beef, lamb, wild duck, and magpie pigeon — and flavoured with pepper, currants and dates."
}
}